
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтррКонтекст = Новый Структура("Местоположение, КодСтраны, Конфигурация");	
	ТекОбъект = РеквизитФормыВЗначение("Объект");	
	ТекОбъект.КонтекстФормыИнициализировать(СтррКонтекст, Параметры); 	
	СтррКонтекст.Местоположение = ТекОбъект.ПрочитатьЗначениеНастройки("МестоположениеДляИнформера");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	МодульКарты = ПолучитьФорму(СтррКонтекст.ПутьКФорме + "МодульКарты");
	
	Если СтррКонтекст.Конфигурация = "УНФ_UA" Тогда
		СтррКонтекст.КодСтраны = "UA";	
	Иначе
		СтррКонтекст.КодСтраны = МодульКарты.КодСтраныМестоположения(СтррКонтекст.Местоположение);
	КонецЕсли;	
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		Элементы.НомерТелефона.Заголовок 		= "+38 (048) 701-71-16";
		Элементы.АдресПочты.Заголовок 			= "support-ua@agentplus.com.ua";
		//Элементы.ОбратныйЗвонок.Видимость 	= Ложь;  //vd_181001
		Элементы.ЛоготипКомпании.Видимость 		= Ложь;
		Элементы.ЛоготипКомпанииUA.Видимость 	= Истина;
		Элементы.Контакты.Видимость 			= Истина;
		Элементы.ОбщиеСведения.Заголовок		= НСтр("ru = 'ЧП ""Агент Софт"" 
                                                        |Номер телефона: +38 (048) 701-71-15 
                                                        |Электронная почта: sales-ua@agentplus.com.ua'; uk = 'ПП ""Агент Софт"" 
                                                        |Номер телефону: +38 (048) 701-71-15 
                                                        |Електронна пошта: sales-ua@agentplus.com.ua'");
		Элементы.АдресСайта.Заголовок           = "www.agentplus.com.ua";
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АдресПочтыНажатие(Элемент)
	
	//{{vd_181001 перенесена из УНФ_UA
	//ПараметрыОткрытия = Новый Структура("Основание", ПараметрыПисьмаВТехподдержку());
	//ФормаПисьмаВТехническуюПоддержку = ПолучитьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	//ФормаПисьмаВТехническуюПоддержку.Объект.Тема = "Обращение в техническую поддержку компании ""Агент Плюс""";
	//ФормаПисьмаВТехническуюПоддержку.ТекстПисьма = ТекстПисьма();
	//ФормаПисьмаВТехническуюПоддержку.Открыть();
	
	//УНФ
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипСобытия", ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЭлектронноеПисьмо"));
	ЗначенияЗаполнения.Вставить("Контрагент", ПолучитьКонтрагентаОтправкиПисьма());
	ЗначенияЗаполнения.Вставить("Тема", НСтр("ru='Обращение в техническую поддержку компании ""Агент Софт""';uk='Звернення в технічну підтримку компанії ""Агент Софт""'"));
	ЗначенияЗаполнения.Вставить("Содержание", ТекстПисьма());
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	//УНФ

	//}}vd_181001
	
КонецПроцедуры

&НаКлиенте
Процедура ОбратныйЗвонокНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("https://www.agentplus.com.ua");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/services/#callback");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДистрибутивМТБазоваяНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("https://www.agentplus.com.ua/downloads/"); //ЗапуститьПриложение("http://www.agentplus.com.ua/mobiletrade");//vd_181001
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/downloads/#mt");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДистрибутивПлатформыНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("https://www.agentplus.com.ua/downloads/"); //vd_181001 ЗапуститьПриложение("http://www.agentplus.com.ua/applatform");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/downloads/#platform");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыАгентПлюсНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("https://www.agentplus.com.ua/downloads/"); //vd_181001 ЗапуститьПриложение("http://www.agentplus.com.ua/products");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/downloads/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПартнераНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("https://www.agentplus.com.ua/partners/"); //vd_181001 ЗапуститьПриложение("http://www.agentplus.com.ua/partners");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru/partners/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСайтаНажатие(Элемент)
	
	Если СтррКонтекст.КодСтраны = "UA" Тогда
		ЗапуститьПриложение("https://www.agentplus.com.ua/");
	Иначе
		ЗапуститьПриложение("http://www.agentplus.ru");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЛКСсылкаНажатие(Элемент)
	ЗапуститьПриложение("https://agentplus.online/");
КонецПроцедуры

// ОбработчикиСобытийЭлементовФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

//Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыПисьмаВТехподдержку()

	Если СтррКонтекст.КодСтраны = "UA" Тогда
		АдресТехническойПоддержки = "support-ua@agentplus.com.ua";
		ПредставлениеАдресаТехническойПоддержки = НСтр("ru='Служба техподдержки ""Агент Софт""';uk='Служба технічної підтримки ""Агент Софт""'");
	Иначе
		АдресТехническойПоддержки = "support@agentplus.ru"; //Элементы.АдресПочты.Заголовок;
		ПредставлениеАдресаТехническойПоддержки = НСтр("ru='Служба техподдержки ""Агент Плюс""';uk='Служба технічної підтримки ""Агент Плюс""'");
	КонецЕсли;
	Контакты = Новый Структура;
	Контакты.Вставить("Адрес", АдресТехническойПоддержки);
	Контакты.Вставить("Контакт", "");
	Контакты.Вставить("Представление", ПредставлениеАдресаТехническойПоддержки);
	
	Основание = Новый Структура;
	Основание.Вставить("Основание", Неопределено);
	Основание.Вставить("Команда", "Отправить");
	Основание.Вставить("Контакт", Контакты);
	
	Возврат Основание;
	
КонецФункции // ПараметрыПисьмаВТехподдержку()

&НаСервере
Функция ТекстПисьма()

	Текст = НСтр("ru='/ЗДЕСЬ НЕОБХОДИМО ПОДРОБНО ОПИСАТЬ СУТЬ ПРОБЛЕМЫ ИЛИ ПРЕДЛОЖЕНИЯ/';uk='/ ТУТ ПОТРІБНО ДОКЛАДНО ОПИСАТИ СУТЬ ПРОБЛЕМИ АБО ПРОПОЗИЦІЇ /'");
	// Оставляем место для текста пользователя
	Для Сч=0 По 5 Цикл
		Текст = Текст + Символы.ПС;	
	КонецЦикла;
	
	Текст = Текст + НСтр("ru='/БЛОК ИНФОРМАЦИИ О СИСТЕМЕ, СОБРАННОЙ АВТОМАТИЧЕСКИ."
"УБЕДИТЕЛЬНО ПРОСИМ НЕ УДАЛЯТЬ СОБРАННЫЕ СИСТЕМОЙ СВЕДЕНИЯ, ЗА ИСКЛЮЧЕНИЕМ ТЕХ,"
"КОТОРЫЕ ВЫ СОЧТЕТЕ СЕКРЕТНЫМИ"
"КОМПАНИЯ РАЗРАБОТЧИК ОБЯЗУЕТСЯ СОХРАНЯТЬ КОНФИДЕНЦИАЛЬНОСТЬ ВСЕЙ ПОЛУЧЕННОЙ ИНФОРМАЦИИ/';uk=""/ БЛОК ІНФОРМАЦІЇ ПРО СИСТЕМУ, зібраних АВТОМАТИЧНО."
"ПЕРЕКОНЛИВО ПРОСИМО НЕ ВИДАЛЯТИ ЗІБРАНІ СИСТЕМОЮ ВІДОМОСТІ, ЗА ВИНЯТКОМ ТИХ,"
"ЯКІ ВИ ВИЗНАЧАЄТЕ СЕКРЕТНИМИ"
"КОМПАНІЯ РОЗРОБНИК ЗОБОВ'ЯЗУЄТЬСЯ ЗБЕРІГАТИ КОНФІДЕНЦІЙНІСТЬ ВСІЄЇ ОТРИМАНОЇ ІНФОРМАЦІЇ /""");
		
		// Получаем информацию о программе стандартными методами 1С
		Текст = Текст + Символы.ПС;
		Текст = Текст + Символы.ПС;
		Текст = Текст + НСтр("ru='ИНФОРМАЦИЯ О ПРОГРАММЕ:';uk='ІНФОРМАЦІЯ ПРО ПРОГРАМУ:'");
		Текст = Текст + Символы.ПС;
		Текст = Текст + ТекстИнформацииОПрограмме();
		//
		
	Возврат Текст;
КонецФункции // ТекстПисьма()

&НаСервере
Функция ТекстИнформацииОПрограмме()
	
	Текст = "";
	Текст = Текст + НСтр("ru='Конфигурация: ';uk='Конфігурація: '") + Метаданные.Имя  + " (" + Метаданные.Синоним + ")";	
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Поставщик: ';uk='Постачальник: '") + Метаданные.Поставщик;
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Версия: ';uk='Версія: '") + Метаданные.Версия;	
	Текст = Текст + Символы.ПС;
	
	Текст = Текст + НСтр("ru='Версия модуля обмена данными: ';uk='Версія модуля обміну даними: '") + Объект.ВерсияНастроек;	
	Текст = Текст + Символы.ПС;
	
	Текст = Текст + НСтр("ru='Пользователь: ';uk='Користувач: '") + ИмяПользователя();	 	
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Полное имя пользователя: ';uk=""Повне ім'я користувача: """) + ПолноеИмяПользователя();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Имя компьютера: ';uk=""Ім'я комп'ютера: """) + ИмяКомпьютера();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Каталог программы: ';uk='Каталог програми: '") + КаталогПрограммы();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Каталог временных файлов: ';uk='Каталог тимчасових файлів: '") + КаталогВременныхФайлов();    
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Код локализации: ';uk='Код локалізації: '") + КодЛокализации();
	Текст = Текст + Символы.ПС;	
	Текст = Текст + НСтр("ru='Строка соединения ИБ: ';uk=""Рядок з'єднання ІБ: """) + СтрокаСоединенияИнформационнойБазы(); 
		
	Возврат Текст;
КонецФункции // ТекстИнформацииОПрограмме()


&НаСервере
//vd_181001 перенесена из УНФ_UA
Функция ПолучитьКонтрагентаОтправкиПисьма()
	// Вставить содержимое обработчика.
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	СсылкаКонтрагент = ТекОбъект.ПолучитьКонтрагентаКомпанииАгентПлюс();
	Возврат СсылкаКонтрагент;
	
КонецФункции


#КонецОбласти
