// Недоделанная форма!!! Не понятно почему тут фиксированные запросы, а на форму можно добавлять новые, но без указания идентификаторов!

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВосстановитьНастройкиСервер();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

	СохранитьНастройкиСервер();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапросыМобильныхУстройств

&НаКлиенте
Процедура ЗапросыМобильныхУстройствВидЗапросаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ЗаполнитьВидыЗапросов(Элемент.СписокВыбора);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)

	ЗаполнитьСписокЗапросов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСписокЗапросов()

	Объект.ЗапросыМобильныхУстройств.Очистить();

	СтррЗапрос = Новый Структура("Идентификатор,ВидЗапроса,Наименование");
	
	СтррЗапрос.Идентификатор = Новый УникальныйИдентификатор("b386dacd-d56f-48b4-a076-083b7e013369");
	СтррЗапрос.ВидЗапроса 	 = НСтр("ru='Полный';uk='Повний'");
	СтррЗапрос.Наименование  = НСтр("ru='Обновить все';uk='Оновити всі'");
	ЗаполнитьЗначенияСвойств(Объект.ЗапросыМобильныхУстройств.Добавить(), СтррЗапрос);
	
	СтррЗапрос.Идентификатор = Новый УникальныйИдентификатор("67f3e7c2-0711-4555-b816-d214e81ca840");
	СтррЗапрос.ВидЗапроса	 = НСтр("ru='Взаиморасчеты';uk='Взаєморозрахунки'");
	СтррЗапрос.Наименование	 = НСтр("ru='Обновить взаиморасчеты';uk='Оновити взаєморозрахунки'");
	ЗаполнитьЗначенияСвойств(Объект.ЗапросыМобильныхУстройств.Добавить(), СтррЗапрос);
	
	СтррЗапрос.Идентификатор = Новый УникальныйИдентификатор("00d68c63-a1d0-4e9d-bf25-43f0d8480cfa");
	СтррЗапрос.ВидЗапроса	 = НСтр("ru='История продаж';uk='Історія продажів'");
	СтррЗапрос.Наименование	 = НСтр("ru='Обновить историю продаж';uk='Оновити історію продажів'");
	ЗаполнитьЗначенияСвойств(Объект.ЗапросыМобильныхУстройств.Добавить(), СтррЗапрос);
	
	СтррЗапрос.Идентификатор = Новый УникальныйИдентификатор("361e8f8f-ec4c-4e38-a3bd-8ccf97b692b6");
	СтррЗапрос.ВидЗапроса	 = НСтр("ru='Маршруты';uk='Маршрути'");
	СтррЗапрос.Наименование	 = НСтр("ru='Обновить маршруты';uk='Оновити маршрути'");
	ЗаполнитьЗначенияСвойств(Объект.ЗапросыМобильныхУстройств.Добавить(), СтррЗапрос);
	
	СтррЗапрос.Идентификатор = Новый УникальныйИдентификатор("b3d7b609-0d2e-4059-8878-41afd160a5e5");
	СтррЗапрос.ВидЗапроса	 = НСтр("ru='Номенклатура';uk='Номенклатура'");
	СтррЗапрос.Наименование	 = НСтр("ru='Обновить остатки';uk='Оновити залишки'");
	ЗаполнитьЗначенияСвойств(Объект.ЗапросыМобильныхУстройств.Добавить(), СтррЗапрос);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыЗапросов(ВидыЗапросов)

	ВидыЗапросов.Очистить();
	ВидыЗапросов.Добавить(НСтр("ru='Полный';uk='Повний'"), НСтр("ru='Полный';uk='Повний'"));
	ВидыЗапросов.Добавить(НСтр("ru='Взаиморасчеты';uk='Взаєморозрахунки'"), НСтр("ru='Взаиморасчеты';uk='Взаєморозрахунки'"));
	ВидыЗапросов.Добавить(НСтр("ru='История продаж';uk='Історія продажів'"), НСтр("ru='История продаж';uk='Історія продажів'"));
	ВидыЗапросов.Добавить(НСтр("ru='Маршруты';uk='Маршрути'"), НСтр("ru='Маршруты';uk='Маршрути'"));
	ВидыЗапросов.Добавить(НСтр("ru='Номенклатура';uk='Номенклатура'"), НСтр("ru='Номенклатура';uk='Номенклатура'"));

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиСервер()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ВосстановитьЗначенияНастроекОбработки(НастройкиФормы());
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСервер()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СохранитьЗначенияНастроекОбработки(НастройкиФормы());

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиФормы()
	
	Возврат "ЗапросыМобильныхУстройств";
	
КонецФункции 

#КонецОбласти